app/controllers/messages_controller.rb

    def create
        @message = Message.create(message_params)
        if @message.errors.any?
---
SELECT "messages".* FROM "messages"

    def find_message
        begin
            @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]