app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY updated_at DESC  [["user_id", 2]]
INSERT INTO "messages" ("m_text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["m_text", "Do you like postman?"], ["created_at", "2021-06-25 00:26:54.246595"], ["updated_at", "2021-06-25 00:26:54.246595"]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" ORDER BY updated_at DESC
INSERT INTO "messages" ("m_text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["m_text", "My first authenticated message"], ["created_at", "2021-06-25 02:29:49.699807"], ["updated_at", "2021-06-25 02:29:49.699807"], ["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def index
        @messages = []
        if (params[:username])
            Message.find_by_user(params[:username]).order('updated_at DESC').each do |msg|
                @messages << Message.find_by(id: msg.id).transform_message
            end
        else
            Message.order('updated_at DESC').each do |msg|
                @messages << Message.find_by(id: msg.id).transform_message

INSERT INTO "messages" ("m_text", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["m_text", ""], ["created_at", "2021-07-01 04:22:11.395075"], ["updated_at", "2021-07-01 04:22:11.395075"], ["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 1]]
---
    def create
        #@message = Message.create(message_params)
        @message = current_user.messages.create(message_params)
        if @message.errors.any?

UPDATE "messages" SET "m_text" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["m_text", "Ruby on Rails vs Express"], ["updated_at", "2021-07-08 05:45:16.263759"], ["id", 1]]
---
    def update
        @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 9]]
---
    def destroy
        @message.delete

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY updated_at DESC  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def my_messages
        @messages = []
        Message.find_by_user(current_user.username).order('updated_at DESC').each do |msg|
            @messages << Message.find_by(id: msg.id).transform_message

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def find_message
        begin
            @message = Message.find(params[:id])