app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "isAdmin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "isAdmin" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-07-08 03:22:48.335051"], ["isAdmin", false], ["id", 5]]

    def sign_in
        @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jairo@email.com"], ["LIMIT", 1]]