app/models/message.rb

    def self.find_by_user(username)
        user = User.find_by(username: username)
        return self.where(user: user)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jairo"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY updated_at DESC  [["user_id", 1]]